; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	instrument11 - instrument
	satellite5 - satellite
	instrument12 - instrument
	instrument13 - instrument
	thermograph4 - mode
	thermograph2 - mode
	infrared1 - mode
	image0 - mode
	infrared3 - mode
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation1 - direction
	Star5 - direction
	GroundStation2 - direction
	Star6 - direction
	GroundStation0 - direction
	Planet7 - direction
	Star8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 thermograph4)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 thermograph4)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 infrared3)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 thermograph2)
	(supports instrument4 infrared3)
	(calibration_target instrument4 Star6)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 thermograph4)
	(supports instrument5 image0)
	(calibration_target instrument5 GroundStation0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star9)
	(supports instrument6 infrared1)
	(supports instrument6 thermograph2)
	(calibration_target instrument6 GroundStation0)
	(supports instrument7 image0)
	(supports instrument7 thermograph4)
	(calibration_target instrument7 GroundStation1)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon10)
	(supports instrument8 infrared1)
	(calibration_target instrument8 GroundStation1)
	(calibration_target instrument8 GroundStation4)
	(supports instrument9 thermograph2)
	(supports instrument9 thermograph4)
	(supports instrument9 image0)
	(calibration_target instrument9 Star5)
	(calibration_target instrument9 GroundStation0)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation3)
	(supports instrument10 infrared1)
	(supports instrument10 thermograph4)
	(calibration_target instrument10 GroundStation2)
	(calibration_target instrument10 GroundStation0)
	(supports instrument11 infrared3)
	(supports instrument11 thermograph2)
	(supports instrument11 infrared1)
	(calibration_target instrument11 GroundStation2)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star9)
	(supports instrument12 thermograph4)
	(supports instrument12 image0)
	(supports instrument12 infrared1)
	(calibration_target instrument12 GroundStation0)
	(supports instrument13 infrared3)
	(supports instrument13 image0)
	(calibration_target instrument13 GroundStation0)
	(calibration_target instrument13 Star6)
	(on_board instrument12 satellite5)
	(on_board instrument13 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation3)
)
(:goal (and
	(pointing satellite0 Star8)
	(pointing satellite3 GroundStation4)
	(have_image Planet7 thermograph2)
	(have_image Star8 thermograph2)
	(have_image Star9 infrared1)
	(have_image Phenomenon10 image0)
	(have_image Star11 thermograph2)
))

)

; plan
1. (turn_to satellite5 groundstation0 groundstation3)
   deleted: (pointing satellite5 groundstation3)
   added: (pointing satellite5 groundstation0)
   goals met: 0 of 7
2. (switch_on instrument12 satellite5)
   deleted: (power_avail satellite5)
   added: (power_on instrument12)
   goals met: 0 of 7
3. (calibrate satellite5 instrument12 groundstation0)
   added: (calibrated instrument12)
   goals met: 0 of 7
4. (turn_to satellite5 star9 groundstation0)
   deleted: (pointing satellite5 groundstation0)
   added: (pointing satellite5 star9)
   goals met: 0 of 7
5. (take_image satellite5 star9 instrument12 infrared1)
   added: (have_image star9 infrared1)
   goals met: 1 of 7
6. (turn_to satellite5 phenomenon10 star9)
   deleted: (pointing satellite5 star9)
   added: (pointing satellite5 phenomenon10)
   goals met: 1 of 7
7. (turn_to satellite3 groundstation4 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 groundstation4)
   goals met: 2 of 7
8. (turn_to satellite0 groundstation3 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 groundstation3)
   goals met: 2 of 7
9. (take_image satellite5 phenomenon10 instrument12 image0)
   added: (have_image phenomenon10 image0)
   goals met: 3 of 7
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 7
11. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 3 of 7
12. (turn_to satellite0 planet7 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet7)
   goals met: 3 of 7
13. (take_image satellite0 planet7 instrument0 thermograph2)
   added: (have_image planet7 thermograph2)
   goals met: 4 of 7
14. (turn_to satellite0 star11 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star11)
   goals met: 4 of 7
15. (take_image satellite0 star11 instrument0 thermograph2)
   added: (have_image star11 thermograph2)
   goals met: 5 of 7
16. (turn_to satellite0 star8 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star8)
   goals met: 6 of 7
17. (take_image satellite0 star8 instrument0 thermograph2)
   added: (have_image star8 thermograph2)
   goals met: 7 of 7
